var BloodType = [{
        "_id" : "b-A",
        "Type" : "A",
        "Style" : "세심하고 배려심이 강해 편안하고 안정적인 분위기를 주는 로맨틱가이!",
        "Advantages" : "집중력이 강함 | 참을성과 규칙적인 생활을 선호함 | 신뢰감이 있음",
        "Disadvantage" : "과도한 걱정과 우려 | 스트레스",
        "Attack" : "기존 대인관계에 대한 방어벽이 높기에, 자신을 배려해주고, 인정해주는 상대를 원한다"
    },

    {
        "_id" : "b-B",
        "Type" : "B",
        "Style" : "강렬한 남자. 불필요하고 거추장한 것을 싫어하고, 자유로운 것을 좋아한다.",
        "Advantages" : "개성이 강함 | 창의적임 | 신박한 생각 | 독특한 행동 방식",
        "Disadvantage" : "때때로 감정적 | 과도한 변덕이나 충동에 따른 판단을 하기도 함",
        "Attack" : "호기심이 강하고 관심분야에 집중하기 때문에, 상대가 관심있어하는 주제를 함께 공유해보세요"
    },

    {
        "_id" : "b-O",
        "Type" : "O",
        "Style" : "유쾌하고 밝고 긍정적인 성격이다. 인기가 가장 많은 유형",
        "Advantages" : "활발하고 외향적인 성격 | 적극적인 행동 | 강한 도전정신 | 끈기와 의지력",
        "Disadvantage" : "고집이 쎔 | 때때로 과한 적극성 | 모방", 
        "Attack" : "다른 사람의 아픔에 약하기 때문에, 모성애를 자극하거나 애교를 피워보세요!"
    },

    {
        "_id" : "b-AB",
        "Type" : "AB",
        "Style" : "냉철하고 이성적인 남자. 효율적인 것을 좋아하고 딱딱해보이지만 헌신적이다.",
        "Advantages" : "논리적 | 융통성 | 다양한 분야에 대한 관심 | 판단력이 좋음",
        "Disadvantage" : "불확실성이나 불안감 때문에 일을 미루는 경우가 있다",
        "Attack" : "적당한 거리를 두고 나를 조금씩 알리기. 가식적인 행동이나 밀당은 싫어함."
    }
];