var StarType = [{
        "_id" : "s-Aries",
        "type" : "양자리",
        "Style" : "사랑에 쉽게 빠지고, 쉽게 식는 사람",
        "Advantages" : "솔직함 | 뒤끝이 없음 | 열정적임",
        "Disadvantage" : "자기중심적 | 외로움을 많이 탐 | 변덕스러움",
        "Attack" : "사랑이 쉽게 식기때문에, 흥미가 떨어지지 않도록 직설적으로 표현하는게 좋음"
    },

    {
        "_id" : "s-Taurus",
        "type" : "황소자리",
        "Style" : "조용하고 부드러운 분위기를 가진 사람",
        "Advantages" : "너그러움 | 사교적이라 인기가 많음",
        "Disadvantage" : "무뚝뚝함 | 느림 | 책임지기 싫어함",
        "Attack" : "관심있는 분야에 대해 함께 이야기를 나누며 천천히 맞춰주는 걸 좋아함"
    },

    {
        "_id" : "s-Gemini",
        "type" : "쌍둥이자리",
        "Style" : "성격이 좋아 인간관계가 좋은 사람",
        "Advantages" : "재치있음 | 독특한 안목 | 말을 잘함",
        "Disadvantage" : "성실성 부족 | 과한 자유로움",
        "Attack" : "자신의 일을 말하는 걸 어려워 하기 때문에, 편하고 솔직한 분위를 만들어주는 사람을 선호함"
    },

    {
        "_id" : "s-Cancer",
        "type" : "게자리",
        "Style" : "사람을 돌보는 것을 좋아하고, 상냥한 사람",
        "Advantages" : "성실함 | 건전함 | 친한사람에게 잘해줌",
        "Disadvantage" : "무관심 | 까칠함 | 경계심이 많음",
        "Attack" : "자신이 좋아하는 사람에게는 모든 걸 내주기 때문에, 신뢰감을 만드는게 중요함"
    },

    {
        "_id" : "s-leo",
        "type" : "사자자리",
        "Style" : "당당하고 남자다운 사람",
        "Advantages" : "좋고 싫음이 확실한 성격",
        "Disadvantage" : "자존심이 강함 | 강박관념이 있음",
        "Attack" : "자존심이 강하기 때문에 칭찬에 약하다 칭찬을 많이 해주는 걸 좋아함"
    },

    {
        "_id" : "s-Virgo",
        "type" : "처녀자리",
        "Style" : "성실하고 계획적인 사람",
        "Advantages" : "이상적이고 건전함 | 기준이 뚜렷함",
        "Disadvantage" : "복잡함 | 까칠함 | 감정을 드러내지 않음",
        "Attack" : "작은 일에도 엄청난 신경을 쓰기 때문에, 작은 일도 먼저 알아주는 걸 좋아함"
    },

    {
        "_id" : "s-libra",
        "type" : "천칭자리",
        "Style" : "인간관계가 좋고, 인기가 많은 사람",
        "Advantages" : "말을 잘함 | 사람을 잘 다룸",
        "Disadvantage" : "재미를 중시함 | 타인에 대한 기준이 깐깐함",
        "Attack" : "주변에 사람이 많기 때문에, 많은 사람 중 특별한 사람이 되는 것이 중요함"
    },

    {
        "_id" : "s-Scorpio",
        "type" : "전갈자리",
        "Style" : "신비로운 분위기의 사람",
        "Advantages" : "친절함 | 순종적 | 과묵하고 얌전함",
        "Disadvantage" : "속을 알 수 없음 | 욕심이 많음",
        "Attack" : "자신의 사적인 영역을 중요시하기 때문에, 둘만의 비밀을 만드는걸 좋아함"
    },

    {
        "_id" : "s-Sagittarius",
        "type" : "사수자리",
        "Style" : "시원시원하고 쿨한 사람",
        "Advantages" : "합리적 | 시원시원한 성격",
        "Disadvantage" : "규칙을 싫어함 | 강박이 없고 안정적인 걸 싫어함",
        "Attack" : "좋아하는 사람에게 집착하기 때문에, 모든 행동을 믿고 지켜봐주는 걸 좋아함"
    },

    {
        "_id" : "s-Capricorn",
        "type" : "염소자리",
        "Style" : "성실하지만 욕심많은 사람",
        "Advantages" : "착함 | 성실함 | 목표지향적",
        "Disadvantage" : "과하게 보수적 | 과한 걱정",
        "Attack" : "욕심이 많아 함께 목표를 이룰 수 있는 사람을 좋아함"
    },

    {
        "_id" : "s-Aquarius",
        "type" : "물병자리",
        "Style" : "독특하고 개성있는 사람",
        "Advantages" : "침착함 | 화술이 좋음 | 유치하지 않음",
        "Disadvantage" : "현실감각과 이상이 뒤죽박죽 섞여있음",
        "Attack" : "특이한 걸 좋아해, 나만의 특징이나 특성을 칭찬해주는 걸 좋아함"
    },

    {
        "_id" : "s-Pisces",
        "type" : "물고기자리",
        "Style" : "상냥하고 사람을 좋아하는 사람",
        "Advantages" : "타인과 대화, 공감을 잘함 | 마음이 넓음",
        "Disadvantage" : "타인에게 과하게 기대는 성향이 있음",
        "Attack" : "정이 많기 때문에, 고민상담과 같은 대화를 하는 걸 좋아함"
    }
];